### Import pandas and read in the banklist.csv file into a dataframe called banks.

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [7]:
banks = pd.read_csv("Banklist.csv")
banks.drop(["Unnamed: 7"],axis = 1, inplace=True)
banks.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17

### What are the column names?

In [8]:
banks.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

### How many States (ST) are represented in this data set?

In [11]:
len(banks.ST.unique())

44

In [12]:
banks.ST.nunique()

44

### Get a list or array of all the states in the data set.

In [15]:
banks.ST.unique()

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'],
      dtype=object)

### What are the top 5 states with the most failed banks?

In [21]:
banks.groupby("ST").count()

    Bank Name  City  CERT  Acquiring Institution  Closing Date  Updated Date
ST
AL          7     7     7                      7             7             7
AR          3     3     3                      3             3             3
AZ         16    16    16                     16            16            16
CA         41    41    41                     41            41            41
CO         10    10    10                     10            10            10
CT          2     2     2                      2             2             2
FL         75    75    75                     75            75            75
GA         93    93    93                     93            93            93
HI          1     1     1                      1             1             1
IA          2     2     2                      2             2             2
ID          2     2     2                      2             2             2
IL         67    67    67                     67            67            67
IN          3     3     3                      3             3             3
KS          9     9     9                      9             9             9
KY          2     2     2                      2             2             2
LA          4     4     4                      4             4             4
MA          1     1     1                      1             1             1
MD         10    10    10                     10            10            10
MI         14    14    14                     14            14            14
MN         23    23    23                     23            23            23
MO         16    16    16                     16            16            16
MS          2     2     2                      2             2             2
NC          7     7     7                      7             7             7
NE          3     3     3                      3             3             3
NH          1     1     1                      1             1             1
NJ          7     7     7                      7             7             7
NM          3     3     3                      3             3             3
NV         12    12    12                     12            12            12
NY          5     5     5                      5             5             5
OH          8     8     8                      8             8             8
OK          7     7     7                      7             7             7
OR          6     6     6                      6             6             6
PA         10    10    10                     10            10            10
PR          4     4     4                      4             4             4
SC         10    10    10                     10            10            10
SD          1     1     1                      1             1             1
TN          7     7     7                      7             7             7
TX         12    12    12                     12            12            12
UT          8     8     8                      8             8             8
VA          5     5     5                      5             5             5
WA         19    19    19                     19            19            19
WI         11    11    11                     11            11            11
WV          1     1     1                      1             1             1
WY          1     1     1                      1             1             1

In [22]:
banks.groupby("ST").count().head()

    Bank Name  City  CERT  Acquiring Institution  Closing Date  Updated Date
ST
AL          7     7     7                      7             7             7
AR          3     3     3                      3             3             3
AZ         16    16    16                     16            16            16
CA         41    41    41                     41            41            41
CO         10    10    10                     10            10            10

In [32]:
banks.groupby("ST").count().sort_values("Bank Name",ascending = False).iloc[:5]["Bank Name"]

ST
GA    93
FL    75
IL    67
CA    41
MN    23
Name: Bank Name, dtype: int64

### What are the top 5 acquiring institutions?

In [42]:
banks["Acquiring Institution"].value_counts().sort_values(ascending=False).iloc[:5]

No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Name: Acquiring Institution, dtype: int64

### How many banks has the State Bank of Texas acquired? How many of them were actually in Texas?

In [45]:
banks.head(10)

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
5,Harvest Community Bank,Pennsville,NJ,34951,First-Citizens Bank & Trust Company,13-Jan-17,18-May-17
6,Allied Bank,Mulberry,AR,91,Today's Bank,23-Sep-16,17-Nov-16
7,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,19-Aug-16,1-Jun-17
8,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,6-May-16,6-Sep-16
9,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,29-Apr-16,6-Sep-16

In [47]:
banks[banks["Acquiring Institution"]=="State Bank of Texas"]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
21,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,24-Oct-14,6-Jan-16
450,Millennium State Bank of Texas,Dallas,TX,57667,State Bank of Texas,2-Jul-09,26-Oct-12

In [49]:
banks[banks["Acquiring Institution"]=="State Bank of Texas"]["Bank Name"].nunique()

3

In [63]:
banks[banks["Acquiring Institution"]=="State Bank of Texas"]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
21,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,24-Oct-14,6-Jan-16
450,Millennium State Bank of Texas,Dallas,TX,57667,State Bank of Texas,2-Jul-09,26-Oct-12

### What is the most common city in California for a bank to fail in?

In [76]:
banks[banks["ST"]=="CA"].groupby("City")["Bank Name"].count().sort_values(ascending = False)

City
Los Angeles         4
San Diego           2
San Francisco       2
Palm Desert         2
La Jolla            2
Newport Beach       2
Solvang             1
San Luis Obispo     1
San Rafael          1
Santa Monica        1
Bakersfield         1
San Clemente        1
Stockton            1
Temecula            1
Torrance            1
Ventura             1
Westminster         1
Sonoma              1
Pomona              1
Redlands            1
Rancho Cucamonga    1
Calabasas           1
Pasadena            1
Palm Springs        1
Oakland             1
Nevada City         1
Napa                1
Merced              1
Irvine              1
Granite Bay         1
Culver City         1
Chico               1
Woodland Hills      1
Name: Bank Name, dtype: int64

### How many failed banks don't have the word "Bank" in their name?

In [97]:
banks.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17

In [80]:
banks["Bank Name"].apply(lambda x : "Bank" not in x).sum()

14

### How many bank names start with the letter 's' ?

In [83]:
banks["Bank Name"].apply(lambda x: x.upper()[0]=="S").sum()

53

### How many CERT values are above 20000 ?

In [87]:
len(banks[banks["CERT"]>20000])

417

### How many bank names consist of just two words? (e.g. "First Bank" , "Bank Georgia" )

In [91]:
banks["Bank Name"].apply(lambda x : len(x.split())==2).sum()

114

### How many banks closed in the year 2008?

In [94]:
from datetime import datetime

In [114]:
pd.to_datetime(banks["Closing Date"]).apply(lambda x: x.year == 2008).sum()

25

In [107]:
banks["Closing Date"].apply(lambda x: x.split("-")[2]== "08").sum()

25

In [102]:
("28-Apr-17").split("-")[2]

'17'